spec/support/vcr_cassettes/mpi/find_candidate/valid_no_gender.yml

---
http_interactions:
- request:
    method: post
    uri: "<MVI_URL>"
    body:
      encoding: ASCII-8BIT
      base64_string: |
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTY5ZGQ2OTc4LTg2MWQtNGM0MC1iMDc2LTFkM2E2MTdiNmI0
        MyIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE5MDgyODE5MTQx
        OCIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8ZGF0YUVudGVyZXIgdHlw
        ZUNvZGU9IkVOVCIgY29udGV4dENvbnRyb2xDb2RlPSJBUCI+CiAgICAgICAg
        ICA8YXNzaWduZWRQZXJzb24gY2xhc3NDb2RlPSJBU1NJR05FRCI+CiAgICAg
        ICAgICAgIDxpZCBleHRlbnNpb249Ijc5NjEyMjMwNiIgcm9vdD0iMi4xNi44
        NDAuMS4xMTM4ODMuNzc3Ljk5OSIvPgogICAgICAgICAgICA8YXNzaWduZWRQ
        ZXJzb24gY2xhc3NDb2RlPSJQU04iIGRldGVybWluZXJDb2RlPSJJTlNUQU5D
        RSI+CiAgICAgICAgICAgICAgPG5hbWU+CiAgICAgICAgICAgICAgICA8Z2l2
        ZW4+TWl0Y2hlbGw8L2dpdmVuPgogICAgICAgICAgICAgICAgPGdpdmVuPkc8
        L2dpdmVuPgogICAgICAgICAgICAgICAgPGZhbWlseT5KZW5raW5zPC9mYW1p
        bHk+CiAgICAgICAgICAgICAgPC9uYW1lPgogICAgICAgICAgICA8L2Fzc2ln
        bmVkUGVyc29uPgogICAgICAgICAgPC9hc3NpZ25lZFBlcnNvbj4KICAgICAg
        ICA8L2RhdGFFbnRlcmVyPgogICAgICAgIDxxdWVyeUJ5UGFyYW1ldGVyPgog
        ICAgICAgICAgPHF1ZXJ5SWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy4y
        OC4xLjE4LjUuOTk5IiBleHRlbnNpb249IjE4MjA0Ii8+CiAgICAgICAgICA8
        c3RhdHVzQ29kZSBjb2RlPSJuZXciLz4KICAgICAgICAgIDxtb2RpZnlDb2Rl
        IGNvZGU9Ik1WSS5DT01QMiIvPgogICAgICAgICAgPGluaXRpYWxRdWFudGl0
        eSB2YWx1ZT0iMSIvPgogICAgICAgICAgPHBhcmFtZXRlckxpc3Q+CiAgICAg
        ICAgICAgIDxsaXZpbmdTdWJqZWN0QmlydGhUaW1lPgogICAgICAgICAgICAg
        IDx2YWx1ZSB2YWx1ZT0iMTk0OTAzMDQiLz4KICAgICAgICAgICAgICA8c2Vt
        YW50aWNzVGV4dD5EYXRlIG9mIEJpcnRoPC9zZW1hbnRpY3NUZXh0PgogICAg
        ICAgICAgICA8L2xpdmluZ1N1YmplY3RCaXJ0aFRpbWU+CiAgICAgICAgICAg
        IDxsaXZpbmdTdWJqZWN0SWQ+CiAgICAgICAgICAgICAgPHZhbHVlIHJvb3Q9
        IjIuMTYuODQwLjEuMTEzODgzLjQuMSIgZXh0ZW5zaW9uPSI3OTYxMjIzMDYi
        Lz4KICAgICAgICAgICAgICA8c2VtYW50aWNzVGV4dD5TU048L3NlbWFudGlj
        c1RleHQ+CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVjdElkPgogICAgICAg
        ICAgICA8bGl2aW5nU3ViamVjdE5hbWU+CiAgICAgICAgICAgICAgPHZhbHVl
        IHVzZT0iTCI+CiAgICAgICAgICAgICAgICA8Z2l2ZW4+TWl0Y2hlbGw8L2dp
        dmVuPgogICAgICAgICAgICAgICAgPGdpdmVuPkc8L2dpdmVuPgogICAgICAg
        ICAgICAgICAgPGZhbWlseT5KZW5raW5zPC9mYW1pbHk+CiAgICAgICAgICAg
        ICAgPC92YWx1ZT4KICAgICAgICAgICAgICA8c2VtYW50aWNzVGV4dD5MZWdh
        bCBOYW1lPC9zZW1hbnRpY3NUZXh0PgogICAgICAgICAgICA8L2xpdmluZ1N1
        YmplY3ROYW1lPgogICAgICAgICAgPC9wYXJhbWV0ZXJMaXN0PgogICAgICAg
        IDwvcXVlcnlCeVBhcmFtZXRlcj4KICAgICAgPC9jb250cm9sQWN0UHJvY2Vz
        cz4KICAgIDwvaWRtOlBSUEFfSU4yMDEzMDVVVjAyPgogIDwvZW52OkJvZHk+
        CjwvZW52OkVudmVsb3BlPgo=
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Wed, 28 Aug 2019 19:14:18 GMT
      Content-Length:
      - '2942'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Wed, 28 Aug 2019 19:14:19 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=pWzZpnBQevbZIjxIlgAetU-0GeS6A7kFggLFcZ1wc4Gymr0-0jzz!603826280;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - 4bae058f5d66d28b011bf351
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><env:Header/><env:Body><idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns="urn:hl7-org:v3"><id extension="WSDOC1908281514193450364096012" root="2.16.840.1.113883.4.349"/><creationTime value="20190828151419"/><versionCode code="4.1"/><interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M" root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id extension="200VGOV-69dd6978-861d-4c40-b076-1d3a617b6b43" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><subject typeCode="SUBJ"><registrationEvent classCode="REG" moodCode="EVN"><id nullFlavor="NA"/><statusCode code="active"/><subject1 typeCode="SBJ"><patient classCode="PAT"><id extension="1008714701V416111^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/><id extension="796122306^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/><id extension="9100792239^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/><id extension="1008714701^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/><id root="2.16.840.1.113883.4.349" extension="32383600^PI^200CORP^USVBA^L"/><statusCode code="active"/><patientPerson><name use="L"><given>MITCHELL</given><given>G</given><family>JENKINS</family></name><administrativeGenderCode code="M"/><birthTime value="19490304"/><addr use="PHYS"><streetAddressLine>121 A St</streetAddressLine><city>Austin</city><state>TX</state><postalCode>78772</postalCode><country>USA</country></addr><asOtherIDs classCode="SSN"><id extension="796122306" root="2.16.840.1.113883.4.1"/><scopingOrganization determinerCode="INSTANCE" classCode="ORG"><id root="1.2.840.114350.1.13.99997.2.3412"/></scopingOrganization></asOtherIDs></patientPerson><subjectOf1><queryMatchObservation classCode="COND" moodCode="EVN"><code code="IHE_PDQ"/><value value="166" xsi:type="INT"/></queryMatchObservation></subjectOf1></patient></subject1><custodian typeCode="CST"><assignedEntity classCode="ASSIGNED"><id root="2.16.840.1.113883.4.349"/></assignedEntity></custodian></registrationEvent></subject><queryAck><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="OK"/><resultCurrentQuantity value="1"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode code="new"/><modifyCode code="MVI.COMP2"/><initialQuantity value="1"/><parameterList><livingSubjectBirthTime><value value="19490304"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value extension="796122306" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value use="L"><given>Mitchell</given><given>G</given><family>Jenkins</family></value><semanticsText>Legal Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
    http_version: 
  recorded_at: Wed, 28 Aug 2019 19:14:19 GMT
recorded_with: VCR 3.0.3
